Revit 2026 API

# SlabShapeVertexType Enumeration

---

The type of a SlabShapeVertex

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum SlabShapeVertexType
```
```vb
Public Enumeration SlabShapeVertexType
```
```cpp
public enum class SlabShapeVertexType
```
```fsharp
type SlabShapeVertexType
```

| Member name | Value | Description |
| --- | --- | --- |
| Corner | 1 |  |
| Edge | 2 |  |
| Interior | 3 |  |
| Invalid | 0 |  |

#### Reference

Autodesk.Revit.DB Namespace